---
type: IFCAnyHandle
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 15
tags: [revit-api, class]
---

# IFCAnyHandle

`Autodesk.Revit.DB.IFC.IFCAnyHandle` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateAggregateAttribute | 2013 | `public IFCAggregate CreateAggregateAttribute ( string name )` |
| Method | Delete | 2012 | `public void Delete ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetAttribute | 2013 | `public IFCData GetAttribute ( string name )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Method | IsSubTypeOf | 2013 | `public bool IsSubTypeOf ( string typeName )` |
| Method | IsTypeOf | 2013 | `public bool IsTypeOf ( string typeName )` |
| Method | SetAttribute | — | `` |
| Method | UnsetAttribute | 2013 | `public void UnsetAttribute ( string name )` |
| Property | HasValue | 2012 | `public bool HasValue { get ; }` |
| Property | Id | 2012 | `public int Id { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StepId | 2014 | `public int StepId { get ; }` |
| Property | TypeName | 2012 | `public string TypeName { get ; }` |